<a href="https://colab.research.google.com/github/ViktorKch/mlcourse/blob/master/Assignment%20%231.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd

In [0]:
PATH = '/content/athlete_events.csv'

In [0]:
data = pd.read_csv(PATH)

In [5]:
data.head()

   ID                      Name  ...                             Event  Medal
0   1                 A Dijiang  ...       Basketball Men's Basketball    NaN
1   2                  A Lamusi  ...      Judo Men's Extra-Lightweight    NaN
2   3       Gunnar Nielsen Aaby  ...           Football Men's Football    NaN
3   4      Edgar Lindenau Aabye  ...       Tug-Of-War Men's Tug-Of-War   Gold
4   5  Christine Jacoba Aaftink  ...  Speed Skating Women's 500 metres    NaN

[5 rows x 15 columns]

In [6]:
data[data.Year == 1992].groupby(by=['Sex'],as_index=False)['Age'].min()

  Sex   Age
0   F  12.0
1   M  11.0

In [7]:
columns_person = ['ID','Name','Sex','Age','Height','Weight','NOC',"Sport"]
data_new = data.loc[(data.Year == 2012)&(data.Sex == 'M')&(data.Sport == 'Basketball'), columns_person].drop_duplicates()
data_new.head()

        ID                       Name Sex  ...  Weight  NOC       Sport
1186   664       Kieron Robert Achara   M  ...   110.0  GBR  Basketball
6119  3444     Al-Farouq Ajiede Aminu   M  ...    98.0  NGR  Basketball
6120  3445  Abdul Wahab "Alade" Aminu   M  ...   102.0  NGR  Basketball
6631  3711        David Emil Andersen   M  ...   102.0  AUS  Basketball
8166  4505       Carmelo Kyan Anthony   M  ...   109.0  USA  Basketball

[5 rows x 8 columns]

In [8]:
list_sport = data.Sport.unique()
list_sport_Basketball = [sport for sport in list_sport if ('basketball' in sport.lower())]
list_sport_Basketball

['Basketball']

In [9]:
print("Validating unique sportsmen: ")
print(data_new.shape[0])
print(data_new.ID.count())

Validating unique sportsmen:
144
144

In [10]:
data_new["flg_Basketball"] = data_new["Sport"].isin(list_sport_Basketball).astype(int)
(data_new.flg_Basketball.value_counts(normalize=True)*100).round(1)

1    100.0
Name: flg_Basketball, dtype: float64

In [12]:
all_male = data.loc[(data.Year == 2012)&(data.Sex == 'M'), columns_person].drop_duplicates()
all_male.head()

     ID                                Name Sex  ...  Weight  NOC      Sport
1     2                            A Lamusi   M  ...    60.0  CHN       Judo
98   34  Jamale (Djamel-) Aarrass (Ahrass-)   M  ...    76.0  FRA  Athletics
134  48                    Abdelhak Aatakni   M  ...    64.0  MAR     Boxing
174  73                           Luc Abalo   M  ...    86.0  FRA   Handball
197  91                      Emanuele Abate   M  ...    80.0  ITA  Athletics

[5 rows x 8 columns]

In [13]:
print("Validating unique sportsmen: ")
print(all_male.shape[0])
print(all_male.ID.count())

Validating unique sportsmen:
5863
5863

In [19]:
x = (144 / 5863) * 100
round(x, 1)

2.5

In [20]:
columns_person = ['ID','Name','Sex','Age','Height','Weight','NOC',"Sport"]
data_new = data.loc[(data.Year == 2000)&(data.Sex == 'F')&(data.Sport == 'Tennis'), columns_person].drop_duplicates()
data_new.head()

         ID                                  Name Sex  ...  Weight  NOC   Sport
8604   4723        Sabine Appelmans (-Haubourdin)   F  ...    60.0  BEL  Tennis
9980   5455                        Shinobu Asagoe   F  ...    58.0  JPN  Tennis
14116  7620    Olga Vladimirovna Barabanshchikova   F  ...    60.0  BLR  Tennis
15804  8522  Nani Rahayu "Yayuk" Basuki-Suharyadi   F  ...    55.0  INA  Tennis
17397  9273                   Daniela "Dja" Bedov   F  ...    52.0  CZE  Tennis

[5 rows x 8 columns]

In [21]:
data_new.Height.describe().round(1)

count     88.0
mean     171.8
std        6.6
min      150.0
25%      168.0
50%      172.0
75%      176.0
max      191.0
Name: Height, dtype: float64

In [22]:
max_Weight = data[data.Year == 2006]['Weight'].max()
data.loc[(data.Year == 2006)&(data.Weight == max_Weight),:]

        ID               Name Sex  ...     Sport                    Event  Medal
8102  4476  Patrick R. Antaki   M  ...  Skeleton  Skeleton Men's Skeleton    NaN

[1 rows x 15 columns]

In [23]:
data.loc[(data.Year == 2006)&(data.Weight == max_Weight),:].Sport

8102    Skeleton
Name: Sport, dtype: object

In [24]:
data.loc[data.Name == 'John Aalberg'].Year.nunique()

2

In [26]:
data[(data.Year == 2008)&(data.Sport == 'Tennis')&(data['NOC'].isin(['SUI']))].groupby(by=['Team','Medal'], as_index = False)['ID'].count()

          Team Medal  ID
0  Switzerland  Gold   2

In [0]:
def n_medal(country): 
    print(country,':',data[(data.Year==2016)&(data.Team==country)&(data.Medal.notnull())]['Medal'].count(),"medals")

In [30]:
n_medal('Spain')
n_medal('Italy')

Spain : 43 medals
Italy : 70 medals

In [31]:
data[(data.Year==2008)]["Age"].describe()

count    13600.000000
mean        25.734118
std          5.685902
min         12.000000
25%         22.000000
50%         25.000000
75%         29.000000
max         67.000000
Name: Age, dtype: float64

In [32]:
pd.cut(data.loc[(data.Year==2008),['ID','Age']]['Age'],bins = 4,duplicates='drop',right=False).value_counts()

[12.0, 25.75)      7369
[25.75, 39.5)      5915
[39.5, 53.25)       298
[53.25, 67.055)      18
Name: Age, dtype: int64

In [33]:
pd.cut(data.loc[(data.Year==2008),['ID','Age']].drop_duplicates()['Age'],bins = 4,duplicates='drop',right=False).value_counts()

[12.0, 25.75)      5677
[25.75, 39.5)      5001
[39.5, 53.25)       208
[53.25, 67.055)      12
Name: Age, dtype: int64

In [0]:
def Olympics(city): 
    return(data.loc[(data.City==city),['City','Year','Season']].drop_duplicates())

In [35]:
Olympics('Atlanta')

       City  Year  Season
32  Atlanta  1996  Summer

In [36]:
Olympics('Squaw Valley')

            City  Year  Season
83  Squaw Valley  1960  Winter

In [37]:
(data[data.Year == 2002]).groupby(by=['Year','Season'],as_index=False)['Sport'].nunique()

0    15
Name: Sport, dtype: int64

In [38]:
(data[data.Year == 1986]).groupby(by=['Year','Season'],as_index=False)['Sport'].nunique()

Series([], Name: Sport, dtype: int64)